Documents/ЕдинаяНалоговаяДекларация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЕдинаяНалоговаяДекларация</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиНалоговойДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаголовок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПлюсМинус</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неотрицательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЕдинаяНалоговаяДекларация/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой ЕНД
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьОсновнойФормы(МассивОбъектов, ОбъектыПечати)	
	
	// Переносятся только итоговые строки.
	// Прописываются коды строк непосредственно в запросе.
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)
		|	И (ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""199""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""299""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""499""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""963"")";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_ОсновнаяФорма";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_ОсновнаяФорма_STI_101");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ДанныеПечати.Вставить("Яч050", 0);
		ДанныеПечати.Вставить("Яч051", 0);
		ДанныеПечати.Вставить("Яч053", 0);
		ДанныеПечати.Вставить("Яч054", 0);
		ДанныеПечати.Вставить("Яч055", 0);
		ДанныеПечати.Вставить("Яч056", 0);
		ДанныеПечати.Вставить("Яч057", 0);
		ДанныеПечати.Вставить("Яч058", 0);
		ДанныеПечати.Вставить("Яч059", 0);
		ДанныеПечати.Вставить("Яч060", 0);
		ДанныеПечати.Вставить("Яч061", 0);
		ДанныеПечати.Вставить("Яч062", 0);
		ДанныеПечати.Вставить("Яч063", 0);
		ДанныеПечати.Вставить("Яч064", 0);
		ДанныеПечати.Вставить("Яч065", 0);
		ДанныеПечати.Вставить("Яч066", 0);
		ДанныеПечати.Вставить("Яч067", 0);
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			Если ВыборкаСтрокиОтчета.КодСтроки = "199" Тогда
				ДанныеПечати.Яч050 = ВыборкаСтрокиОтчета.Сумма;
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "299" Тогда
				ДанныеПечати.Яч051 = ВыборкаСтрокиОтчета.Сумма;							
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "499" Тогда
				ДанныеПечати.Яч053 = ВыборкаСтрокиОтчета.Сумма;
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "963" Тогда
				ДанныеПечати.Яч054 = ВыборкаСтрокиОтчета.Сумма;
			КонецЕсли;				
		КонецЦикла;
		
		ДанныеПечати.Вставить("Яч052", ДанныеПечати.Яч050 - ДанныеПечати.Яч051);
		Если ДанныеПечати.Яч052 < 0 Тогда
			ДанныеПечати.Вставить("ЗнакЯч052", "-");
		КонецЕсли;
		
		СтавкаНалогаНаПрибыль = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(Шапка.КонецПериода, Шапка.Организация).СтавкаНалогаНаПрибыль;
		ДанныеПечати.Яч060 = СтавкаНалогаНаПрибыль;
		
		ДанныеПечати.Яч058 = ДанныеПечати.Яч052 - ДанныеПечати.Яч053 - ДанныеПечати.Яч054;
		Если ДанныеПечати.Яч058 < 0 Тогда
			ДанныеПечати.Яч059 = ДанныеПечати.Яч058;
		Иначе
			ДанныеПечати.Яч061 = Формат((ДанныеПечати.Яч058 * ДанныеПечати.Яч060) / 100, "ЧДЦ=2");
			ДанныеПечати.Яч065 = ДанныеПечати.Яч061;
			ДанныеПечати.Яч067 = ДанныеПечати.Яч065;
		КонецЕсли;
		
			
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение1ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения1(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		""Яч"" + КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение1";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение1");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			ДанныеПечати.Вставить(ВыборкаСтрокиОтчета.КодСтроки, ВыборкаСтрокиОтчета.Сумма);			
		КонецЦикла;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение2ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения2(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		""Яч"" + ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки КАК КодСтроки,
		|		ВЫБОР
		|			КОГДА ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма < 0
		|				ТОГДА -ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма
		|			ИНАЧЕ ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма
		|		КОНЕЦ КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение2";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение2");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ДанныеПечати.Вставить("Яч298", 0);
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			
			Если ВыборкаСтрокиОтчета.КодСтроки = "Яч298" ИЛИ ВыборкаСтрокиОтчета.КодСтроки = "Яч298а" Тогда
				ДанныеПечати.Яч298 = ДанныеПечати.Яч298 + ВыборкаСтрокиОтчета.Сумма;
			КонецЕсли;	
			
			ДанныеПечати.Вставить(СтрЗаменить(ВыборкаСтрокиОтчета.КодСтроки, "а", ""), ВыборкаСтрокиОтчета.Сумма);			
		КонецЦикла;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение3ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения3(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение3";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение3");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение4ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения4(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение4";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение4");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение5";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_01ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение5_01";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5_01");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_02ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение5_02";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5_02");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение6ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения6(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение6";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение6_01ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения6_01(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение6_01";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6_01");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение7ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения7(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение7";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение7");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение8ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения8(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение8";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение8");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения9(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение9";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение9");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОсновнаяФормаОтчета") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ОсновнаяФормаОтчета", 
		НСтр("ru = 'Основная форма'"), 
		ПечатьОсновнойФормы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_ОсновнаяФорма_STI_101");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение1", 
		НСтр("ru = 'Приложение 1'"), 
		ПечатьПриложения1(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение1");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение2", 
		НСтр("ru = 'Приложение 2'"), 
		ПечатьПриложения2(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение2");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение3", 
		НСтр("ru = 'Приложение 3'"), 
		ПечатьПриложения3(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение3");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение4", 
		НСтр("ru = 'Приложение 4'"), 
		ПечатьПриложения4(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение4");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5", 
		НСтр("ru = 'Приложение 5'"), 
		ПечатьПриложения5(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_01") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_01", 
		НСтр("ru = 'Приложение 5 - 01'"), 
		ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5_01");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_02") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_02", 
		НСтр("ru = 'Приложение 5 - 02'"), 
		ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5_02");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение6") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение6", 
		НСтр("ru = 'Приложение 6'"), 
		ПечатьПриложения6(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение6_01") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение6_01", 
		НСтр("ru = 'Приложение 6 - 01'"), 
		ПечатьПриложения6_01(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6_01");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение7") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение7", 
		НСтр("ru = 'Приложение 7'"), 
		ПечатьПриложения7(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение7");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение8") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение8", 
		НСтр("ru = 'Приложение 8'"), 
		ПечатьПриложения8(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение8");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение9") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение9", 
		НСтр("ru = 'Приложение 9'"), 
		ПечатьПриложения9(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение9");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОсновнаяФормаОтчета";
	КомандаПечати.Представление = НСтр("ru = 'Основная форма'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 (Совокупный годовой доход)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 (Расходы, подлежащие вычету)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение3";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 3 (Необлагаемые доходы и доходы, обложенные у источника выплаты)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение4";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 4 (Прибыль, освобожденная от налога)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 5;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение5,Приложение5_01,Приложение5_02";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 5 (Налог на имущество)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 6;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение6,Приложение6_01";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 6 (Земельный налог)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение7";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 7 (Специальные налоговые режимы)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 8;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение8";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 8 (Горнодобывающее или горноперерабатывающее предприятие)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 9;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение9";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 9 (Расшифровка отдельных показателей экономической деятельности)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Дополнить данные печати
//
// Параметры:
//  ДанныеПечати	 - Структура - 
//
Процедура ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати)

	КонтактныеДанные = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСведенияОбОрганизации(СтруктураПараметров.Организация, СтруктураПараметров.КонецПериода);

	ДанныеПечати.Вставить("ОрганизацияНаменованиеПолное", КонтактныеДанные.НаименованиеПолное);
	ДанныеПечати.Вставить("Налоговая", КонтактныеДанные.ГНСНаименование);
	ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.Город);
	ДанныеПечати.Вставить("АдресУлица", КонтактныеДанные.Улица);
	ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Тел);
	
	ОКПО = КонтактныеДанные.ОКПО;
	ДанныеПечати.Вставить("ОКПО1", Сред(ОКПО,1,1));
	ДанныеПечати.Вставить("ОКПО2", Сред(ОКПО,2,1));
	ДанныеПечати.Вставить("ОКПО3", Сред(ОКПО,3,1));
	ДанныеПечати.Вставить("ОКПО4", Сред(ОКПО,4,1));
	ДанныеПечати.Вставить("ОКПО5", Сред(ОКПО,5,1));
	ДанныеПечати.Вставить("ОКПО6", Сред(ОКПО,6,1));
	ДанныеПечати.Вставить("ОКПО7", Сред(ОКПО,7,1));
	ДанныеПечати.Вставить("ОКПО8", Сред(ОКПО,8,1));

	ИНН = КонтактныеДанные.ИНН;
	ДанныеПечати.Вставить("ИНН1", Сред(ИНН, 1, 1));
	ДанныеПечати.Вставить("ИНН2", Сред(ИНН, 2, 1));
	ДанныеПечати.Вставить("ИНН3", Сред(ИНН, 3, 1));                           
	ДанныеПечати.Вставить("ИНН4", Сред(ИНН, 4, 1));
	ДанныеПечати.Вставить("ИНН5", Сред(ИНН, 5, 1));
	ДанныеПечати.Вставить("ИНН6", Сред(ИНН, 6, 1));
	ДанныеПечати.Вставить("ИНН7", Сред(ИНН, 7, 1));
	ДанныеПечати.Вставить("ИНН8", Сред(ИНН, 8, 1));
	ДанныеПечати.Вставить("ИНН9", Сред(ИНН, 9, 1));
	ДанныеПечати.Вставить("ИНН10", Сред(ИНН, 10, 1));
	ДанныеПечати.Вставить("ИНН11", Сред(ИНН, 11, 1));
	ДанныеПечати.Вставить("ИНН12", Сред(ИНН, 12, 1));
	ДанныеПечати.Вставить("ИНН13", Сред(ИНН, 13, 1));
	ДанныеПечати.Вставить("ИНН14", Сред(ИНН, 14, 1));         
	
	КодГНС = КонтактныеДанные.ГНСКод;
	ДанныеПечати.Вставить("ГНС1", Сред(КодГНС, 1, 1));
	ДанныеПечати.Вставить("ГНС2", Сред(КодГНС, 2, 1));
	ДанныеПечати.Вставить("ГНС3", Сред(КодГНС, 3, 1));
	
	НачалоПериода = СтруктураПараметров.НачалоПериода;
	ДанныеПечати.Вставить("ДатаН1", Сред(НачалоПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаН2", Сред(НачалоПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаН3", Сред(НачалоПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаН4", Сред(НачалоПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаН5", Сред(НачалоПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаН6", Сред(НачалоПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаН7", Сред(НачалоПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаН8", Сред(НачалоПериода, 10, 1));	
	
	КонецПериода = СтруктураПараметров.КонецПериода;		
	ДанныеПечати.Вставить("ДатаК1", Сред(КонецПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаК2", Сред(КонецПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаК3", Сред(КонецПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаК4", Сред(КонецПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаК5", Сред(КонецПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаК6", Сред(КонецПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаК7", Сред(КонецПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаК8", Сред(КонецПериода, 10, 1));
	
	Индекс = КонтактныеДанные.Индекс;
	ДанныеПечати.Вставить("ИНД1", Сред(Индекс, 1, 1));	
	ДанныеПечати.Вставить("ИНД2", Сред(Индекс, 2, 1));	
	ДанныеПечати.Вставить("ИНД3", Сред(Индекс, 4, 1));	
	ДанныеПечати.Вставить("ИНД4", Сред(Индекс, 5, 1));	
	ДанныеПечати.Вставить("ИНД5", Сред(Индекс, 7, 1));	
	ДанныеПечати.Вставить("ИНД6", Сред(Индекс, 8, 1));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
